<?php namespace App\Exceptions;

use Exception;

class ApiException extends Exception {

	/**
	 * 错误码映射,一个模块预留100个错误码,比如返佣单模块-20100到-20199
	 * 
	 * -50000到-49999 一般错误
	 * -40000到-49999 权限错误
	 */
	public $mapping = [


		-40000=>'token无效',
		-40001=>'token过期',
		-40002=>'未授权访问',
	
		//用户模块
		-50001=>'用户名已存在',
		-50002=>'用户创建失败',
		-50003=>'用户更新失败',

		//返佣单模块
		-50100=>'返佣单创建失败',
		-50101=>'返佣单更新失败',
		-50102=>'返佣单确认失败',
		-50103=>'返佣单导入失败',
		-50104=>'返佣单删除失败',
		-50105=>'未知返佣单ID',
		-50106=>'必须指定返佣单ID',
		-50107=>'请上传文件',
		-50108=>'请上传xls或者xlsx文件',

		//权限模块
		-50200=>'权限创建失败',
		-50201=>'权限更新失败',

		//角色模块
		-50300=>'角色名已存在',
		-50301=>'角色创建失败',
		-50302=>'角色更新失败',

		//Index模块
		-50400=>'验证码错误',
		-50401=>'当前帐户已停用',
		-50402=>'当前帐户已注销',
		-50402=>'用户名或密码错误',
		-50402=>'退出登录失败',

		//佣金单模块
		-50500=>'未知佣金单ID',
		
		//收款模块
		-50800=>'参数错误',
		-50801=>'更新失败',
		-50802=>'ID不正确',
			
		
		//消息模块
		-50900=>'参数错误',
		-50901=>'更新失败',
		-50902=>'消息ID不正确',
			
		//商户 店铺 账号模块
		-51000=>'参数错误',
		-51001=>'更新失败',
		-51002=>'ID不正确',
		-51003=>'编号重复已经存在',
		-51004=>'该商户还有正在合作的店铺请先终止该商户所有店铺合作，再删除商户',
		-51010=>'用户名重复',
		-51011=>'店铺账号冲突（当前店铺已存在普通用户（或超级管理员），请查询）',
		-51020=>'店铺状态错误',
			

	];

	public function getError(){
		return array_key_exists($this->code, $this->mapping)?$this->mapping[$this->code]:'';
	}

	public function getMapping(){
		return $this->mapping;
	}

}
